rammp-org/prototype-fw/STEM_V3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# The connected ESP32-P4 board is revision v1.3. Revisions below v3.0 use a
# different hardware configuration and must be selected explicitly.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Common ESP-related
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---------------------------------------------------------------------------
# Native USB (ESP32-P4 USB-OTG HS): one composite device with a vendor /
# WebUSB interface and a CDC-ACM interface, both carrying espp stream_frame
# traffic (see main/stem_protocol.hpp). The console / CLI stays on the
# USB-Serial-JTAG port, which has its own PHY on the P4.
# ---------------------------------------------------------------------------
# esp_tinyusb gates the vendor class driver behind CONFIG_TINYUSB_VENDOR_COUNT;
# > 0 compiles it in so espp::UsbDevice's vendor function (class 0xFF + WebUSB
# descriptors) works.
CONFIG_TINYUSB_VENDOR_COUNT=1
# Size the FIFOs to hold a complete stream_frame: a max OTA data frame is 4111
# bytes and a core-dump DATA reply ~2.1 KB; the esp_tinyusb defaults (vendor TX
# 64, CDC TX 512) would truncate them.
CONFIG_TINYUSB_VENDOR_RX_BUFSIZE=4200
CONFIG_TINYUSB_VENDOR_TX_BUFSIZE=4200
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_RX_BUFSIZE=4200
CONFIG_TINYUSB_CDC_TX_BUFSIZE=4200
# The usb_device component's sources reference the HID class driver APIs, which
# esp_tinyusb gates behind CONFIG_TINYUSB_HID_COUNT -- keep it > 0 so they
# compile (no HID interface is instantiated).
CONFIG_TINYUSB_HID_COUNT=1

# ---------------------------------------------------------------------------
# Flash layout: 16MB module, two OTA app slots + a core-dump partition
# (partitions.csv). Rollback makes a freshly-installed OTA image boot
# PENDING_VERIFY; main.cpp marks it valid once the firmware is up.
# ---------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Panic core dumps are saved to the `coredump` flash partition (ELF) and read
# back by the espp coredump module on the next boot / served to the web
# console.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
